# Shared cross-platform CLI core (macOS + Linux). Install: brew bundle --file=~/.dotfiles/Brewfile
tap "jandedobbeleer/oh-my-posh"

# Shell + prompt
brew "zsh"
brew "starship"
brew "jandedobbeleer/oh-my-posh/oh-my-posh"
brew "zoxide"
brew "atuin"
brew "fzf"
brew "gum"

# Modern CLI replacements (aliased in zsh-aliases)
brew "bat"
brew "fd"
brew "eza"
brew "ripgrep"
brew "dust"
brew "duf"

# Dev tooling
brew "neovim"
brew "git"
brew "stow"
brew "lazygit"
brew "lazydocker"
brew "asdf"

# Remote session + monitoring (remote-control setup)
brew "zellij"
brew "mosh"
brew "glances"
brew "lnav"
